tutorials/mesh/moveDynamicMesh/circCylinder3dHex/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (0 0 0);

referenceLevel      (0 0 0);

boundaryField
{
    bottomWall
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    topWall
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    sideWall
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
