tutorials/mesh/moveDynamicMesh/circCylinder3dHex/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottomWall
    {
        type            wall;
        nFaces          89;
        startFace       3676;
    }
    topWall
    {
        type            wall;
        nFaces          89;
        startFace       3765;
    }
    sideWall
    {
        type            wall;
        nFaces          480;
        startFace       3854;
    }
)


// ************************************************************************* //
